'''
Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в
один рядок через кому. Отримайте для масиву середнє арифметичне.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

array = [] # Ініціалізуємо масив
x = input() # Вводимо строку чисел через кому
array = x.split(",") # заповнюємо масив розділивши числа по комі
sum = 0 # Ініціалізуємо суму усіх елементів
for i in range(5):
    sum += int(array[i]) # додаємо усі елементи до загальної змінної
print("Середнє значення: ", sum // 5) # віводимо відповідь
