'''
Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

temperature = [20, 14, 25, 14, 20, 30, 27, 28, 17, 15]  # Ініціалізуємо масив з температурами(можна дані змінити)

answer = 0
normal = int(input("Input normal temperature to swim: "))

for i in range(10):
    if temperature[i] >= normal:
        answer += 1
print("Days for swimming - ", answer)
