'''
Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

temperature = [0, 5, -3, 0, 2, -4, -10, 3, 7, 1]  # Ініціалізуємо масив з температурами(можна дані змінити)

answer = 0  # Ініціалізуємо змінну у якій будемо зберігати відповідь
seredn = 0  # Ініціалізуємо змінну у якій будемо зберігати середнє значення

for i in range(10):  # проходимо 10 разів по циклу
    seredn += temperature[i]  # додаємо значення до змінної

seredn = seredn / 10  # ділимо на 10 і отримуємо середнє значення

for i in range(10):  # проходимо 10 разів по циклу
    if temperature[i] > seredn:  # перевіряємо чи температура вище середньої
        answer += 1  # додаємо до результату 1
print(answer)  # виводимо відповідь
