'''
Створіть масив з 15 цілочисельних елементів і визначте серед них
мінімальне значення.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

array = [] # Ініціалізуємо масив

for i in range(15): # 15 разів виконуємо цикл
    x = int(input()) # вводимо з руки число
    array.append(x) # додаємо його у масив
min = array[0] # Іеіціалізуємо змінну мінімального числа та присвоюємо їй знначення першого елемента у масиві

for i in range(15): # проходимо 15 разів цикл
    if (array[i] < min): # якщо елемент масиву менший ніж мінімальне число то,
        min = array[i] # присваюємо змінній з мінімальним число значення цього елемента
print(min) # віводимо його на екран
