'''
Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 200 до 300.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random

sum = 0  # Ініціалізуємо змінну сума
a = [random.randint(200, 300) for i in range(20)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран
for i in range(20):  # проходимо по елементам масиву
    if (a[i] % 2 == 3):  # перевіряємо чи елемент масиву задовільяє умові
        sum += a[i]  # якщо так, то додаємо до суми
print(sum)
