'''
Знайти суму всіх елементів масиву дійсних чисел, більших за задане
число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами
від 50 до 100.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random

sum = 0  # Ініціалізуємо змінну сума
a = [random.uniform(50, 100) for i in range(20)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран

x = int(input("Input a number: "))  # Користувач вводить число

sum = 0  # Ініціалізуємо змінну сума
for i in range(20):  # проходимо елементам
    if a[i] > x:  # перевіряємо чи елемент масиву більший за це число
        sum += a[i]  # додаємо до суми
print(sum)  # виводимо відповідь
