'''
Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 5 до 500.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random

answer = 1  # Ініціалізуємо змінну результат
a = [random.randint(5, 500) for i in range(10)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран
for i in range(10):  # проходимо по елементам масиву
    if (a[i] % 3 == 0 and a[i] % 9 == 0):  # перевіряємо чи елемент масиву ділиться націло на 3 та 9
        answer *= a[i]  # якщо так, то домножаємо до результату

if answer == 1:  # якщо відповідь рівна 1, то таких чисел не було
    print("There is no such numbers")
else:  # інакше виводимо відповідь
    print(answer)
