'''
Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
числами від 500 до 1000.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random

a = [random.randint(500, 1000) for i in range(30)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран

answer = 0  # Ініціалізуємо змінну результат

for i in range(30):  # проходимо по елементам масиву
    if (a[i] % 5 == 0 and a[i] % 8 == 0):  # перевіряємо чи елемент масиву ділиться націло на 5 та 8
        answer += a[i]  # якщо так, то додаємо до результату

print(answer)
