'''
Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до
100.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random

a = [random.randint(10, 100) for i in range(10)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран

answer = 1  # Ініціалізуємо змінну результат

for i in range(10):  # проходимо по елементам масиву
    if (a[i] % 5 == 0):  # перевіряємо чи елемент масиву ділиться націло на 5
        answer *= a[i]  # якщо так, то домножаємо до результату

if answer == 1:  # якщо відповідь рівна 1, то таких чисел не було
    print("There is no such numbers")
else:  # інакше виводимо відповідь
    print(answer)
