'''
Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

T = []  # Ініціалізуємо масив температур
for i in range(6):  # проходимо по циклу 6 разів
    x = float(input())  # вводимо значення з клавіатури
    T.append(x)  # додаємо це значення у масив

minT = T[0]  # ініціалізуємо мінімальне значення температури і присваюємо йому перший елемент масиву
maxT = T[0]  # ініціалізуємо максимальне значення температури і присваюємо йому перший елемент масиву
seredn = 0  # Ініціалізумо змінну у якій буде зберігатись середнє значення

for i in range(6):  # проходимо 6 разівв по циклу
    seredn += T[i]  # додаємо до змінної усі значення масива
    if (T[i] > maxT):  # перевіряємо чи є цей елемент більший за максимальний
        maxT = T[i]  # якшо так, присваюємо максимальному значенню цей елемент
    elif (T[i] < minT):  # перевіряємо чи є цей елемент менший за мінімальний
        minT = T[i]  # якшо так, присваюємо мінімальному значенню цей елемент
seredn = seredn / 6  # ділимо змінну на 6, цим самим отримуємо середнє значення
print(f" Max T - {maxT};\n Min T - {minT};\n seredn T - {seredn}")  # виводимо відповіді
