'''
Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

falls = [45, 23, 46, 50, 12, 54, 60, 79, 23, 10, 34, 13]  # ініціалізуємо масив з показниками опадів

sumF = 0  # ініціалізуємо змінну, яка відповідає за суму усіх опадів
seredn = 0  # ініціалізуємо змінну, яка відповідає за середнє значення опадів
minF = falls[0]  # ініціалізуємо змінну, яка відповідає за мінімальне значення опаду
indexMin = 0  # ініціалізуємо змінну, яка відповідає за індекс мінімального значення
dry = 0  # ініціалізуємо змінну, яка відповідає за к-сть сухих місяців

for i in range(12):  # проходиом по циклу 12 разів
    sumF += falls[i]  # додаємо поелементно до суми
    seredn += falls[i]  # додаємо поелементно до середнього значення
    if (falls[i] < 30):  # перевіряємо чи є цей місяць сухим
        dry += 1  # якшо так, збільшуємо лічильник сухих місяців на 1
    if (falls[i] < minF):  # перевіряємо чи показник менший за мінімальний
        minF = falls[i]  # якшо так, то присваюємо мінімальному значенню це значення
        indexMin = i  # міняємо індекс

# Виводимо выдповіді
print(f"All falls - {sumF};\n"
      f"Seredn fall per month - {seredn/12}\n"
      f"Dry month - {dry}\n"
      f"Driest month - {indexMin+1}")
