'''
Знайти кількість парних елементів одновимірного масиву до першого
зустрінутого числа рівного наперед заданому числу а.
Виконав студент групи КН-А Андрощук Артем Олександрович

'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

m = int(input("Input a stop number: "))
array = []  # Ініціалізуємо масив

answer = 0  # Ініціалізуємо змінну яка підрахує к-сть парних чисел

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

for i in range(n):
    if (array[i] != m):  # перевіряємо чи еемент не рівний стоп числу
        if (array[i] % 2 == 0):  # перевіряємо його на парність
            answer += 1  # збільшуємо лічильник, якщо парне
    else:  # інакше зупиняємо цикл
        break

print("Pair numbers in array before a stop number - ", answer)  # виводимо відповідь
