'''
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які розташовані за першим по порядку мінімальним елементом.
Виконав студент групи КН-А Андрощук Артем Олександрович

'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

answer = 0  # Ініціалізуємо змінну яка підрахує к-сть парних чисел

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

minNum = array[0]  # ініціалізуємо змінну, яка відповідає за мінімальне значення
minIndx = 1  # iніціалізуємо змінну, яка відповідає за індекс мінімального значення
seredn = 0  # ініціалізуємо змінну, яка відповідає за середнє значення

for i in range(n):  # проходимо по циклу n разів
    if array[i] < minNum:  # перевіряємо чи елемент менший за мінімальний
        minNum = array[i]  # якшо так, то присваюємо мінімальному значенню це значення
        minIndx = i  # міняємо індекс
for i in range(n):  # проходимо по циклу n разів
    if (array[i] != minNum):  # перевіряємо чи елемент масиву не рівний найменшому числу
        seredn += array[i]  # додаємо до середнього значення
    else:  # інакше зупиняємо цикл
        break
seredn = seredn / (minIndx)  # ділимо змінну на індекс найменшого числа, адже стільки елементів тоді було задіяно
print(seredn)  # Виводимо відповідь
