'''
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які потрапляють в інтервал від -2 до 10.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

answer = 0  # Ініціалізуємо змінну яка підрахує к-сть парних чисел

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

seredn = 0  # ініціалізуємо змінну, яка відповідає за середнє значення
j = 0 # ініціалізуємо лічильник

for i in range(n): # проходимо по циклу n разів
    if (array[i] > -2 and array[i] < 10): # перевіряємо чи належить елемент інтервалу
        seredn += array[i] # якщо так додаємо до середнього значення
        j += 1 # збільшуємо лічильник
print(seredn / j) # виводимо відповідь

