'''
Змінній t привласнити значення істина, якщо в одновимірному масиві є
хоча б одне від’ємне і парне число.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

t = False

array = []  # Ініціалізуємо масив
n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

for i in range(n): # проходимо по циклу n разів
    if (array[i] < 0 and array[i] % 2 == 0): # перевіряємо умову
        t = True # якщо умова виконалась, міняємо на True
print(t)
