'''
Заданий масив А (1:20). Знайти добуток всіх його ненульових елементів.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

a = []  # Ініціалізуємо масив
answer = 1  # Ініціалізуємо змінну результат

for i in range(20):  # проходимо по циклу 20 разів
    x = int(input())  # вводимо число з клавіатури
    a.append(x)  # додаємо це число до масиву

for i in range(20):  # проходимо по циклу 20 разів
    if (a[i] != 0):  # первіряємо умову
        answer *= a[i]  # множимо на результат
print(answer)  # виводимо відповідь
