'''
Дано два лінійних масиву однакової розмірності. Скласти третій масив з
добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of arrays: "))  # Користувач вводить кількість чисел у масиві

a = []
b = []
c = []

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    a.append(x)  # додаємо це число до масиву
print()
for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    b.append(x)  # додаємо це число до масиву
for i in range(n): # проходимо по циклу n разів
    x = a[i] * b[i] # множимо елементи з однаковими інексами
    c.append(x) #  додаємо це число до масиву
print(c) # Виводимо результат
