'''
Дані про направлення вітру (північний, південний, східний, західний) і
силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
південний вітер з силою, що перевищує 8 м / с.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

a = ["Північний", "Південний", "Східний", "Західний", "Північний", "Південний", "Східний", "Західний", "Північний",
     "Північний"]  # Створюємо масив з назвами вітрів
b = [4, 5, 6, 5, 8, 9, 9, 10, 2, 10]  # Створюємо масив з швидкостями вітрів
c = list(zip(a, b))  # зв'язуємо ці 2 масиви

answer = 0  # Ініціалізуємо змінну з відповіддю
for i in range(10):  # проходимо п оциклу 10 разів
    if c[i].__getitem__(0) == "Південний":  # перевіряємо назву вітру
        if (c[i].__getitem__(1) > 8):  # перевіряємо швидксть вітру
            answer += 1  # змінюємо лічильник на 1
# Виводимо відповідь
print(answer)
