'''
Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які
починаються з певної букви, яка вводиться з клавіатури.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

letter = input("Input first letter of surname")  # Вводимо букву з якої починається прізвище
surnames = ["Андрощук", "Сидоров", "Петров", "Іванов", "Антонов"]  # Створюємо масив з прізвищами
for i in range(5):  # проходимо по масиву
    if surnames[i].__getitem__(0) == letter:  # якщо перша буква елемента масиву рівна першій букві яку ввів користувач
        print(surnames[i])  # то виводимо це прізвище
