'''
Обчислити суму парних елементів одновимірного масиву до першого
зустрінутого нульового елемента.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

sum = 0

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву
for i in range(n):  # проходимо по циклу n разів
    if (array[i] != 0):  # перевіряємо чи елемент не нульовий
        if (array[i] % 2 == 0):  # перевіряємо числа на парність
            sum += array[i]  # додаємо до суми
    else:  # якщо елемент нульовий, закінчуємо цикл
        break
print(sum)
