'''
Підрахувати кількість елементів одновимірного масиву, для яких
виконується нерівність i*i<ai<i!
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import math

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

answer = 0  # Ініціалізуємо змінну яка підрахує к-сть чисел

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

for i in range(n):  # проходимо по циклу n разів
    if (math.pow(i, 2) < array[i] and array[i] < math.factorial(i)):  # перевіряємо умову
        answer += 1  # додаємо до кількості
print(answer)
