'''
Підрахуйте кількість елементів одновимірного масиву, які збігаються зі
своїм номером і при цьому кратні 3.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

answer = 0  # Ініціалізуємо змінну яка підрахує к-сть чисел

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

for i in range(n):  # проходимо по циклу n разів
    if array[i] == i and array[i] % 3 == 0: # перевіряємо умову задачі
        answer += 1
print(answer)
