'''
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

answer = 0  # Ініціалізуємо змінну яка підрахує к-сть чисел

for i in range(n):  # проходимо по циклу n разів
    x = input()  # вводимо назву з клавіатури
    array.append(x)  # додаємо цю назву до масиву
flag = False  # флажок який зміниться якщо знайдемо повторку

for i in range(1, n):  # проходимо по циклу n разів
    if (array[0] == array[i]):  # Перевіряємо чи якийсь із елементів сходиться з першим
        flag = True  # міняємо флажок
if flag:  # перевіряємо флажок, якщо ТАК то видаляємо перший елемент та виводимо на екран повідомлення та масив
    print("Yes it repeats")
    array.remove(array.__getitem__(0))
    print(array)
else:  # якщо НІ то нічого не змінюємо
    print("No it isn't repeat")
