'''
У лінійному масиві знайти максимальний елемент. Вставте порядковий
номер елемента за ним, пересунувши всі залишилися на одну позицію вправо.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву
max = array[0]  # Ініціалізуємо змінну у якій будемо хранити максимальне число
# знаходимо максимальне число
for i in range(n):
    if array[i] > max:
        max = array[i]
array = array[0:array.index(max) - 1] + [array.index(max)] + array[array.index(
    max) - 1:]  # за допомогою зрізу вставляємо його індекс перед ним, змістивши усі елементи
print(array)
