'''
Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
з початку і третього від кінця і т.д.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість прізвищ у масиві

array = []  # Ініціалізуємо масив

for i in range(n):  # проходимо по циклу n разів
    x = input()  # вводимо прізвище з клавіатури
    array.append(x)  # додаємо це прівзище до масиву

for i in range(n // 2):  # проходимо по масиву половину разів від того, скільки там прізвищ
    array[i], array[-i - 1] = array[-i - 1], array[i]  # міняємо їх місцями
print(array)
