'''
Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

a = ['Тату', 'Пірсинг', 'Доставка їжі', 'Буст аккаунта']  # Створюємо масив з назвами послуг
b = [400, 200, 40, 50]  # Створюємо масив з швидкостями вітрів
c = list(zip(b, a))  # зв'язуємо ці 2 масиви

helper = []  # створюємо масив у який будемо зберігати елементи, які задовільняють нас
print(c)  # виводимо 2 таблиці яка задані
g = int(input("Input minimal price: "))  # користувач вводить ціну

for i in range(len(c)):  # проходимо по об'єднаним таблицям
    if (c[i].__getitem__(0) >= g):  # перевіряємо ціну
        helper.append(c[i])  # якщо задовільняє умову додаєо у кінцеву відповідь

print(helper)
