'''
Створіть масив А [1..7] за допомогою генератора випадкових чисел і
виведіть його на екран. Збільште всі його елементи в 2 рази.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random  # імпортуємо бібліотеку для створення масиву з рандомними числами

a = [random.randint(0, 10) for i in range(7)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран
for i in range(7):  # проходимо по елементам масиву
    a[i] *= 2  # збільшуємо елемент масиву у 2 рази
    print(a[i], end=", ")  # виводимо поелементно збільшені числа у масиві
