'''
У лотереї розігрувалося 100 квитків. Таблиця містить 10 номерів
виграшних квитків. Перевірте, чи є квиток з номером N виграшним.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random  # імпортуємо бібліотеку для створення масиву з рандомними числами

a = [random.randint(0, 900) for i in range(100)]  # створюємо масив за допогою генератора списку
winning = [random.randint(0, 900) for i in range(10)]  # Ініціалізуємо масив виграшних білетів

N = int(input("Input your number:"))  # користувач вводить номер білету
print(a)  # виводимо масив на екран
print(winning)
flag = False  # устанавлюємо флажок

# проходимо по всім білетам та перевіряєм чи користувач влучив
for i in range(10):
    if (N == winning[i]):
        flag = True
# якщо флаг = істина -> Виграв, інакше програв
if (flag == True):
    print("You win!")
else:
    print("sorry")
