'''
Дан одновимірний масив а. Сформувати новий масив, який складається
тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
елементів немає, то видати повідомлення.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість прізвищ у масиві

secondArray = []
array = []  # Ініціалізуємо масив

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо прізвище з клавіатури
    array.append(x)  # додаємо це прівзище до масиву

for i in range(n):  # проходимо по циклу n разів
    if (array[i] - i > 10): # перевіряємо умову задачі
        secondArray.append(array[i])

# перевіряємо довжину іншого масиву, якшо рівна 0, то немає таких елементівв
if len(secondArray) != 0:
    print(secondArray)
else:
    print("There is no such elements")
