'''
В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи
масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі
п'ятірки. Додаткового масиву не заводити.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

for i in range(n):  # проходимо по циклу n разів
    while True:
        x = int(input("Input 0 or 1 or 5: "))  # вводимо число з клавіатури
        if x == 1 or x == 0 or x == 5:
            break
    array.append(x)  # додаємо це число до масиву
array.sort() # Сортуємо масив
print(array)
