'''
Введіть масив з 20 елементів і визначте, чи є в ньому елементи з
однаковими значеннями.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

array = []  # Ініціалізуємо масив
for i in range(20):  # проходимо по циклу 20 разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву
helper = set()  # створюємо пусту множину

helper = set(array)  # заповнюємо пусту множину массивом який ввів користуваач
# Так як множина не містить однакових значень, то якщо її довжина буде відрізнятись від довжини масива, то у масиві є повторки
if len(helper) == len(array):
    print("there isn`t equal numbers in your array")
