'''
У будинку, що складається з 30 квартир, переселити мешканців так, щоб
мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

array = []  # Ініціалізуємо масив
for i in range(20):  # проходимо по циклу 30 разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

answer = 0  # Ініціалізуємо змінну яка підрахує к-сть квартир з >5 людей у ній
for i in range(n // 2):  # проходимо по масиву половину разів від того, скільки там квартир
    array[i], array[-i - 1] = array[-i - 1], array[i]  # міняємо їх місцями
for i in range(30):  # проходимо по циклу 30 разів
    if array[i] > 5:  # Перевіряємо к-сть жителів у квартирі
        answer += 1
# Виводимо результати
print(array)
print("The answer is - ", answer)
