'''
Якщо в одновимірному масиві є три поспіль однакових елемента, то
змінній r привласнити значення істина.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

n = int(input("Input quantity of array: "))  # Користувач вводить кількість чисел у масиві

array = []  # Ініціалізуємо масив

for i in range(n):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву
r = False  # Ініціалізуємо змінну

for i in range(n - 2):  # проходимо по масиву n-2 разів, для того, щоб випадково не вийти за рамки масиву
    if array[i] == array[i + 1] and array[i + 1] == array[i + 2]:  # перевіряємо на рівність 3 сусідніх елемента
        r = True
    # Виводимо відповідь
print(r)
