'''
Дан одновимірний масив цілих чисел. Знайдіть, скільки разів в ньому
повторюється найчастіше число.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''
array = []  # Ініціалізуємо масив

for i in range(10):  # проходимо по циклу 10 разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

answers = []  # Новий масив, який буде зберігати в собі к-сті однакових змінних

for i in range(10):  # проходимо по циклу 10 разів
    helper = 0  # допоміжна змінна
    for j in range(10):  # ще раз проходимо по циклу 10 разів
        if (array[i] == array[j]):  # перевіряємо елементи на схожість
            helper += 1  # збільшуємо допоміжну змінну, якщо найшли повторку
    answers.append(helper)  # додаємо значення повторок цього елемента у новий масив

# Шукаємо максимальне значення, яке поступало у новий масив і виводимо його(це і є відповідь)
max = answers[0]
for i in range(len(answers)):
    if max < answers[i]:
        max = answers[i]
print(max)
