'''
Дан одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних
чисел в ньому.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''
array = []  # Ініціалізуємо масив

for i in range(10):  # проходимо по циклу n разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

print(f"There is {len(set(array))} numbers")  # виводимо к-сть елементів множини яка створена із цього масиву
