'''
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random  # імпортуємо бібліотеку для створення масиву з рандомними числами

a = [random.randint(-10, 10) for i in range(8)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран
answer = 0  # Ініціалізуємо змінну яка відповідає за кінцевий результат
for i in range(8):  # проходимо по елементам масиву
    if (a[i] < 0):  # перевіряємо чи елемент масиву від'ємний
        answer += 1  # якщо від'ємний до збільшуємо кінцеви результат на 1
print(answer)  # виводимо відповідь
