'''
Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число
однакових чисел, що йдуть підряд в ньому.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

array = []  # Ініціалізуємо масив

for i in range(10):  # проходимо по циклу 10 разів
    x = int(input())  # вводимо число з клавіатури
    array.append(x)  # додаємо це число до масиву

answers = []  # Новий масив, який буде зберігати в собі к-сті однакових змінних
helper = 1  # допоміжна змінна
for i in range(9):  # проходимо по циклу 9 разів
    if (array[i] == array[i + 1]):  # Перевіряємо збіжність з наступним елементом
        helper += 1  # збільшуємо допоміжну змінну
    else:  # якщо наступний елемент не рівний, то додаємо допоміжну змінну до нового масиву та ставимо значення 1
        answers.append(helper)  #
        helper = 1
# Шукаємо максимальне значення, яке поступало у новий масив і виводимо його(це і є відповідь)
max = answers[0]
for i in range(len(answers)):
    if max < answers[i]:
        max = answers[i]
print(max)
