'''
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random  # імпортуємо бібліотеку для створення масиву з рандомними числами

a = [random.randint(-20, 10) for i in range(12)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран
for i in range(12):  # проходимо по елементам масиву
    if (a[i] < 0):  # перевіряємо чи елемент масиву від'ємний
        a[i] = 0  # якщо від'ємний, о міняємо його на 0
print(a)  # виводимо відповідь
