'''
Створіть цілочисельний масив А [1..15] за допомогою генератора
випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
найбільший елемент масиву і його індекс.
Виконав студент групи КН-А Андрощук Артем Олександрович
'''

import random  # імпортуємо бібліотеку для створення масиву з рандомними числами

a = [random.randint(-15, 30) for i in range(15)]  # створюємо масив за допогою генератора списку
print(a)  # виводимо масив на екран
maxNum = a[0] # створюємо змінну в якій буде хранитись максимальне число та присваюємо їй перше значення масиву
maxIndx = 0 # створюємо змінну в якій буде хранитись індекс максимального числа та присваюємо їй 0
for i in range(15):  # проходимо по елементам масиву
    if (a[i] > maxNum):  # перевіряємо чи елемент масиву більший за максимальне число
        maxNum = a[i] #  якщо так то присваюємо зміннй з максимальним числом елемент масиву
        maxIndx = i # присваюємо змінній з індексом і
print(f"Max number = {maxNum};\n Index = {maxIndx}")  # виводимо відповідь